{
  "sessions": [
    {
      "id": "646535",
      "title": "Hello KI - Die Welt der Embeddings und Neuronale Netzwerke",
      "description": "Der Vortrag gibt Einblicke in die Technologie von AI. Mit praktischen Beispielen veranschaulicht er die Arbeitsweise von AI Lösungen und deren Interaktion mit \"Weltwissen\" erfolgt. Welche Rolle spielen Embeddings, was sind diese und wie entstehen sie.\r\n\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f21baecf-1b61-4e0b-8fb8-71894f39022b"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "641462",
      "title": "Infrastructure as Code and AI - does it fit?",
      "description": "Infrastructure as Code is crucial for the cloud native development. It allows you to automate the deployment of your resources and comes with a lot of other benefits.\r\nHow does Infrastructure as Code harmonize with AI tools like the GitHub Copilot?\r\nI wanted to investigate the matter and examine how well AI tools can be applied to several use cases related to Infrastructure as Code: for code generation, code interpretation, and error analysis. I intend to publish the results of this session.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "52214c40-9cb0-44a6-a1f5-ab2302c9bb40"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": false
    },
    {
      "id": "648654",
      "title": "Supercharge Your AI App - OpenAI Function Calling Inside Out",
      "description": "Function calling is an important capability of the OpenAI ChatGPT API. It has been present for a while and gets new features in ChatGPT's upcoming Assistant API. In this session, Rainer Stropek invites you to a deep dive into the capabilities of function calling. Rainer starts by quickly introducing the basics. Based on that he shows advanced features like streaming of function calls, function parallelization, tips for error handling etc.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "7d6ddad1-fc5e-4fb8-b882-c3878168e8c7"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": false
    },
    {
      "id": "641128",
      "title": "To Containers and Beyond - Kubernetes as a Universal Control Plane",
      "description": "Kubernetes has evolved beyond container orchestration - it is a powerful tool for managing diverse resources, from deployments to infrastructure and cloud resources. It is designed for extensibility and offers a robust foundation for more than just deployments. \r\n\r\nThis talk will dive into the exciting world of extending Kubernetes. We'll explore how Crossplane, an open source CNCF project, takes Kubernetes to a new level and enhances it to a versatile control plane. Further, it'll cover how GitOps can boost this powerful combination by providing automation, security, improved collaboration and more.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0979c01c-b27b-4c4a-be3b-b1d0a927bd6a"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    }
  ],
  "speakers": [
    {
      "id": "0979c01c-b27b-4c4a-be3b-b1d0a927bd6a",
      "firstName": "Katharina",
      "lastName": "Sick",
      "bio": "I'm all about making things user-friendly, especially when it comes to Cloud Native and Kubernetes.\r\n\r\nI've done a fair share of mobile app and backend work, but lately, I'm really into Cloud Native computing and enjoy it a lot.\r\n\r\nOutside of work, you'll find me hanging out in tech and sports communities, cruising on inline skates, exploring new places, or challenging myself with quizzes and games.",
      "tagLine": "Software Engineer at Dynatrace",
      "profilePicture": "https://sessionize.com/image/7aa6-400o400o1-YBTp7dF7xfej9ijKQcRWB8.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        641128
      ],
      "fullName": "Katharina Sick",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f21baecf-1b61-4e0b-8fb8-71894f39022b",
      "firstName": "Mario",
      "lastName": "Schnalzenberger",
      "bio": "Mario Schnalzenberger ist seit über 25 Jahren in der IT-Industrie tätig und setzt sich seit über 15 Jahren im Bereich Statistik und AI als auch im Predictive Bereich mit vielseitigen Lösungen auseinander. Seit fünf Jahren ist er im cubido-Team und unterstützt die Kunden in diesem spannenden Umfeld. Mario hat Abschlüsse in Statistik, Volkswirtschaftslehre und Sozial- und Wirtschaftswissenschaften. Er unterrichtet(e) an mehreren Universitäten und Hochschulen in Österreich sowie der HTL Leonding. Er trägt regelmäßig bei verschiedensten Konferenzen in den vielfältigen Themen der angewandten Statistik, Informatik, IOT und AI vor.",
      "tagLine": "Data Scientist, cubido business solutions GmbH",
      "profilePicture": "https://sessionize.com/image/95d3-400o400o1-R5d3ztRAEtpDbLUkL9oCBf.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        646535
      ],
      "fullName": "Mario Schnalzenberger",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "52214c40-9cb0-44a6-a1f5-ab2302c9bb40",
      "firstName": "Patrick",
      "lastName": "Koch",
      "bio": "Cloud Adoption Engineer & Cloud Evangelist | Blogger \"DevOps Experiences\" 🚀 | Speaker | Co-organizer Microsoft Developer User Group Graz | Microsoft MVP | HashiCorp Ambassador\r\n",
      "tagLine": "Cloud Adoption Engineer & Cloud Evangelist at AVL List GmbH",
      "profilePicture": "https://sessionize.com/image/8a2b-400o400o1-Mc8gNnBmwjdydofLFuRELK.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        641462
      ],
      "fullName": "Patrick Koch",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "7d6ddad1-fc5e-4fb8-b882-c3878168e8c7",
      "firstName": "Rainer",
      "lastName": "Stropek",
      "bio": "Rainer Stropek is co-founder and CEO of the company software architects and has been serving this role since 2008. At software architects Rainer and his team are developing the award-winning SaaS time tracking solution “time cockpit”. Previously, Rainer founded and led two IT consulting firms that worked in the area of developing software solution based on the Microsoft technology stack.\r\n\r\nRainer is recognized as an expert concerning .NET development, software architecture and databases. He has written numerous books and articles on C#, database development, Microsoft Azure, XAML, and web development. Additionally he regularly speaks at conferences, workshops and trainings in Europe and the US. In 2010 Rainer has become one of the first MVPs for the Microsoft Windows Azure platform. In 2015, Rainer also became a Microsoft Regional Director. 2016, Rainer also got the MVP award for Visual Studio and Developer Technologies.\r\n\r\nRainer graduated the Higher Technical School Leonding (AT) for MIS with honors and holds a BSc (Hons) Computer Studies of the University of Derby (UK).",
      "tagLine": "software architects",
      "profilePicture": "https://sessionize.com/image/65ad-400o400o1-d1-fc5e-4fb8-b882-c3878168e8c7.d27878c6-3479-419c-b0e5-861fe90a6a63.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        648654
      ],
      "fullName": "Rainer Stropek",
      "categoryItems": [],
      "questionAnswers": []
    }
  ],
  "questions": [],
  "categories": [],
  "rooms": []
}